app/controllers/opportunities_controller.rb

  def index
    @opportunities = Opportunity.all
---
SELECT * FROM "opportunities"

  def show
    @opportunity = Opportunity.find(params[:id])
---
SELECT * FROM "opportunities" WHERE ("opportunities"."id" = 1)

  def create
    @opportunity = Opportunity.new(params[:opportunity])

    respond_to do |format|
      if @opportunity.save
---
INSERT INTO "opportunities" ("approach", "commitment", "created_at", "title", "updated_at", "user_id", "description", "impact") VALUES('The easiest approach is to build a website to collect proposed projects and allow groups and resources to coalesce around those projects. ', 'I''m willing to work on the implementation of this platform and to help mentor any students that want to help out. I could also design some independent studies for students who wanted to explore some particular aspect of CS by working on this project (e.g. security, database design, ...)', '2010-07-30 16:51:30', 'The Brandeis Idea Exchange', '2010-07-30 16:51:30', 1, 'It is difficult to organize students, faculty, and staff around campus to undertake projects involving significant IT contributions. There are many people with the requisite skills, and many others seeking solutions who have the means to contribute (either by hiring interns or supervising independent studies, or working on the project themselves, or paying a group to complete the project).